emacs.d-gnu/config.org
#+TITLE: init.el
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el

* Table of contents :toc:
- [[#emacs-startup][emacs startup]]
  - [[#shift-theme-variables-to-customel-make-sure-to-create-it-if-it-does-not-exist][shift theme variables to ~custom.el~, make sure to create it if it does not exist]]
  - [[#emacs-startup-performance][emacs startup performance]]
- [[#initialize-package-sources][Initialize package sources]]
  - [[#packageel][Package.el]]
  - [[#straightel-make-sure-to-later-remove-packageel][straight.el: make sure to later remove package.el]]
  - [[#enable-native-comp-for-packages][enable native comp for packages]]
  - [[#quelpa][quelpa]]
  - [[#setting-up-paths][Setting up paths]]
- [[#customizing-the-editor-and-appearence][Customizing the Editor and Appearence]]
  - [[#dashboard][Dashboard]]
  - [[#page-break-lines][Page break lines]]
  - [[#highlight-current-line][highlight current line]]
  - [[#properly-maximize-windws-emacs][properly maximize windws emacs]]
  - [[#theme][theme]]
  - [[#disable-menubar][Disable Menubar]]
  - [[#disable-toolbar][Disable Toolbar]]
  - [[#disable-scrollbar][disable scrollbar]]
  - [[#all-the-icon-fonts][All the icon fonts]]
  - [[#line-numbers][Line Numbers]]
  - [[#doom-modeline][Doom modeline]]
  - [[#loading-the-theme][Loading the theme]]
  - [[#fonts][Fonts]]
  - [[#evil-mode][Evil mode]]
  - [[#undo-system][Undo system]]
  - [[#padding][Padding]]
  - [[#perspective][perspective]]
  - [[#brackets][brackets]]
  - [[#tramp][tramp]]
- [[#hook-to-tangle-on-save][Hook to tangle on save]]
- [[#org-mode][Org mode:]]
  - [[#org-mode-indent][org mode indent]]
  - [[#org-blocks-insert-mode][Org blocks insert mode]]
  - [[#snippets][snippets:]]
  - [[#org-tempo-for-all-the-beautiful-snippets][org tempo for all the beautiful snippets:]]
  - [[#superstar-for-some-pretty-symbols][Superstar for some pretty symbols]]
  - [[#org-toc][org-toc]]
  - [[#company-org-block][company org block]]
  - [[#org-bable-load-all-languages][org-bable load all languages]]
  - [[#org-roam][org roam]]
- [[#tools][Tools]]
  - [[#vterm][vterm]]
  - [[#auto-update-with-emacs][auto update with emacs]]
  - [[#telega][telega]]
  - [[#emacs-pdf-tools][emacs pdf tools]]
  - [[#mu4e][mu4e]]
  - [[#treemacs][treemacs]]
  - [[#elcord][elcord]]
  - [[#shackle][Shackle]]
  - [[#pacman][pacman]]
  - [[#popperel-todo][popper.el TODO]]
  - [[#using-exwm][Using EXWM]]
  - [[#erc-server-settings][ERC server settings]]
  - [[#elfeed-rss-reader][elfeed RSS reader]]
- [[#language-and-completion-support][Language and completion support]]
  - [[#completion-engines][completion engines:]]
  - [[#using-tabnine-for-completion][using tabnine for completion]]
  - [[#emoji-mode][emoji mode]]
  - [[#parentheses-completion][Parentheses Completion]]
  - [[#projectile][Projectile]]
  - [[#languages-and-lsp-mode][languages and lsp-mode]]
  - [[#which-key][which key]]
- [[#prevent-saving-to-x-clipboard-manager][prevent "saving to x clipboard manager]]
- [[#prevent-warnings-buffer][prevent *warnings* buffer]]
- [[#emacs-typing-latency][emacs typing latency]]
- [[#disable-backups][Disable backups]]
- [[#emacs-fixing-some-window-stuff][emacs fixing some window stuff]]
- [[#restart-emacs-package][restart emacs package]]

* emacs startup
** shift theme variables to ~custom.el~, make sure to create it if it does not exist
#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load-file (expand-file-name "custom.el" user-emacs-directory))
  (setq gc-cons-threshold 100000000)
#+end_src
** emacs startup performance
#+begin_src emacs-lisp
    ;; The default is 800 kilobytes.  Measured in bytes.
    ;; (setq gc-cons-threshold (* 50 1000 1000))
    (setq read-process-output-max (* 1024 1024)) ;; 1mb
    (defun efs/display-startup-time ()
      (message "Emacs loaded in %s with %d garbage collections."
	       (format "%.2f seconds"
		       (float-time
			(time-subtract after-init-time before-init-time)))
	       gcs-done))

    (add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src

* Initialize package sources
** Package.el
#+begin_src emacs-lisp

 ;; Initialize package sources
    (require 'package)

  (setq package-archives '(("melpa"  . "https://melpa.org/packages/")
                         ("org"    . "https://orgmode.org/elpa/")
                         ("gnu"    . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

    (package-initialize)
    (unless package-archive-contents
      (package-refresh-contents))

      ;; Initialize use-package on non-Linux platforms
    (unless (package-installed-p 'use-package)
      (package-install 'use-package))

    (require 'use-package)
    (setq use-package-always-ensure t)


#+end_src
