emacs.d-gnu/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-22 Mon 11:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>init.el</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/home/drishal/Desktop/git-stuff/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/home/drishal/Desktop/git-stuff/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">init.el</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8331f16">1. Table of contents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc">toc</span></span></a></li>
<li><a href="#orgef2c4c1">2. emacs startup</a>
<ul>
<li><a href="#org81559d7">2.1. shift theme variables to <code>custom.el</code>, make sure to create it if it does not exist</a></li>
<li><a href="#org3c1def8">2.2. emacs startup performance</a></li>
</ul>
</li>
<li><a href="#orgd3f7575">3. Initialize package sources</a>
<ul>
<li><a href="#org102d45c">3.1. Package.el</a></li>
<li><a href="#org9e53866">3.2. straight.el: make sure to later remove package.el</a></li>
<li><a href="#org9160c4e">3.3. quelpa</a></li>
<li><a href="#org1df2d35">3.4. Setting up paths</a></li>
</ul>
</li>
<li><a href="#org3366ca9">4. Customizing the Editor and Appearence</a>
<ul>
<li><a href="#orgcaeb3bf">4.1. Dashboard</a></li>
<li><a href="#orge7d0978">4.2. Page break lines</a></li>
<li><a href="#org47ffae9">4.3. highlight current line</a></li>
<li><a href="#org806a2fa">4.4. properly maximize windws emacs</a></li>
<li><a href="#org9462a7b">4.5. theme</a></li>
<li><a href="#org6488bda">4.6. Disable Menubar</a></li>
<li><a href="#orge42157e">4.7. Disable Toolbar</a></li>
<li><a href="#org193d40b">4.8. disable scrollbar</a></li>
<li><a href="#org332a1b4">4.9. All the icon fonts</a></li>
<li><a href="#orgb89c04c">4.10. Line Numbers</a></li>
<li><a href="#org1324337">4.11. Doom modeline</a></li>
<li><a href="#orgc47c6ee">4.12. Loading the theme</a></li>
<li><a href="#org0a847b2">4.13. Fonts</a></li>
<li><a href="#orgf87a7b0">4.14. Evil mode</a>
<ul>
<li><a href="#org5716250">4.14.1. Default</a></li>
<li><a href="#orga490346">4.14.2. Evil args</a></li>
<li><a href="#orgaae4cca">4.14.3. Evil intent plus</a></li>
<li><a href="#org677027b">4.14.4. Evil Snipe</a></li>
</ul>
</li>
<li><a href="#org728b95a">4.15. Undo system</a></li>
<li><a href="#org8dafcec">4.16. Padding</a></li>
<li><a href="#orgfe2e429">4.17. perspective</a></li>
<li><a href="#orgeaf6345">4.18. brackets</a></li>
<li><a href="#orgc1e7622">4.19. tramp</a></li>
</ul>
</li>
<li><a href="#orgf09b0f6">5. Hook to tangle on save</a></li>
<li><a href="#org21834cc">6. Org mode:</a>
<ul>
<li><a href="#org069f479">6.1. org mode indent</a></li>
<li><a href="#org3acd352">6.2. snippets:</a>
<ul>
<li><a href="#org92d9b99">6.2.1. ya-snippet</a></li>
<li><a href="#org2dfe9ef">6.2.2. doom snippets</a></li>
</ul>
</li>
<li><a href="#org9f83aa8">6.3. org tempo for all the beautiful snippets:</a></li>
<li><a href="#orgfbb3be4">6.4. Superstar for some pretty symbols</a></li>
<li><a href="#orgbb86630">6.5. org-toc</a></li>
<li><a href="#org99f693c">6.6. company org block</a></li>
<li><a href="#org9ad4534">6.7. org-bable load all languages</a></li>
<li><a href="#orgab48ac6">6.8. org roam</a></li>
</ul>
</li>
<li><a href="#org6095e19">7. Tools</a>
<ul>
<li><a href="#org1915bf9">7.1. vterm</a></li>
<li><a href="#orgb746793">7.2. telega</a></li>
<li><a href="#orgdeae6d7">7.3. emacs pdf tools</a></li>
<li><a href="#org966f370">7.4. mu4e</a></li>
<li><a href="#org68bc48d">7.5. treemacs</a></li>
<li><a href="#orgc969e94">7.6. elcord</a></li>
<li><a href="#orgccd51a1">7.7. Shackle</a></li>
<li><a href="#orgb7f1977">7.8. pacman</a></li>
<li><a href="#org7351716">7.9. popper.el TODO</a></li>
<li><a href="#org03cb49f">7.10. Using EXWM</a></li>
<li><a href="#org22159a1">7.11. ERC server settings</a></li>
<li><a href="#org01862a2">7.12. elfeed RSS reader</a></li>
</ul>
</li>
<li><a href="#orgb4dd6be">8. Language and completion support</a>
<ul>
<li><a href="#orgd64d0a7">8.1. completion engines:</a>
<ul>
<li><a href="#orgc2ea672">8.1.1. company mode</a></li>
</ul>
</li>
<li><a href="#orgb174f94">8.2. using tabnine for completion</a></li>
<li><a href="#orgdb1b9ef">8.3. emoji mode</a></li>
<li><a href="#org85d0fb8">8.4. Parentheses Completion</a></li>
<li><a href="#org4d4f15c">8.5. Projectile</a>
<ul>
<li><a href="#orge94d1dc">8.5.1. vertico and orderless</a></li>
<li><a href="#orga993c93">8.5.2. consult</a></li>
<li><a href="#orgacaed20">8.5.3. helm completion</a></li>
<li><a href="#orgf9ca045">8.5.4. ido</a></li>
<li><a href="#org4abeb81">8.5.5. ivy</a></li>
</ul>
</li>
<li><a href="#org4121ed0">8.6. languages and lsp-mode</a>
<ul>
<li><a href="#org4d78d50">8.6.1. General Setup</a></li>
<li><a href="#org7fbff4a">8.6.2. Sqlplus</a></li>
<li><a href="#orgccecc16">8.6.3. python</a></li>
<li><a href="#orgdf72b3b">8.6.4. Haskell</a></li>
<li><a href="#org66b9b6d">8.6.5. Fish</a></li>
<li><a href="#orgac5577d">8.6.6. nix</a></li>
<li><a href="#orgcb4d168">8.6.7. java</a></li>
<li><a href="#orgeaf6b55">8.6.8. lua</a></li>
<li><a href="#orgfc40d1b">8.6.9. web stuff</a></li>
<li><a href="#org8544720">8.6.10. C/C++ mode</a></li>
<li><a href="#org94d98f6">8.6.11. rust mode</a></li>
<li><a href="#org4066c5b">8.6.12. zig</a></li>
</ul>
</li>
<li><a href="#org70fd8e3">8.7. which key</a></li>
</ul>
</li>
<li><a href="#orgc9bdd13">9. prevent "saving to x clipboard manager</a></li>
<li><a href="#org76f3f10">10. prevent <b>warnings</b> buffer</a></li>
<li><a href="#org1f12cb6">11. emacs typing latency</a></li>
<li><a href="#org1a1d3ab">12. Disable backups</a></li>
<li><a href="#org6b8c7a0">13. emacs fixing some window stuff</a></li>
<li><a href="#org036d680">14. restart emacs package</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8331f16" class="outline-2">
<h2 id="org8331f16"><span class="section-number-2">1.</span> Table of contents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc">toc</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><ul class="org-ul">
<li></li>
<li></li>
</ul></li>
<li><ul class="org-ul">
<li></li>
<li></li>
<li></li>
<li></li>
</ul></li>
<li><ul class="org-ul">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ul></li>
<li></li>
<li><ul class="org-ul">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ul></li>
<li><ul class="org-ul">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ul></li>
<li><ul class="org-ul">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ul></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ul>
</div>
</div>

<div id="outline-container-orgef2c4c1" class="outline-2">
<h2 id="orgef2c4c1"><span class="section-number-2">2.</span> emacs startup</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org81559d7" class="outline-3">
<h3 id="org81559d7"><span class="section-number-3">2.1.</span> shift theme variables to <code>custom.el</code>, make sure to create it if it does not exist</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load-file (expand-file-name "custom.el" user-emacs-directory))
;;(setq gc-cons-threshold 10000000)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3c1def8" class="outline-3">
<h3 id="org3c1def8"><span class="section-number-3">2.2.</span> emacs startup performance</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; The default is 800 kilobytes.  Measured in bytes.
;; (setq gc-cons-threshold (* 50 1000 1000))
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
	   (format "%.2f seconds"
		   (float-time
		    (time-subtract after-init-time before-init-time)))
	   gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3f7575" class="outline-2">
<h2 id="orgd3f7575"><span class="section-number-2">3.</span> Initialize package sources</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org102d45c" class="outline-3">
<h3 id="org102d45c"><span class="section-number-3">3.1.</span> Package.el</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
</pre>
</div>
</div>
</div>
