emacs.d-gnu/config.org
** straight.el: make sure to later remove package.el
#+begin_src emacs-lisp
  ;; (defvar bootstrap-version)
  ;; (let ((bootstrap-file
  ;;        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
  ;;       (bootstrap-version 5))
  ;;   (unless (file-exists-p bootstrap-file)
  ;;     (with-current-buffer
  ;;         (url-retrieve-synchronously
  ;;          "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
  ;;          'silent 'inhibit-cookies)
  ;;       (goto-char (point-max))
  ;;       (eval-print-last-sexp)))
  ;;   (load bootstrap-file nil 'nomessage))

  ;; (straight-use-package 'use-package) ; make sure use package is installed
  ;; (use-package el-patch
  ;;   :ensure t)                   ;and now we wi
  ;;ll have use package here
#+end_src
note: Users of Emacs versions >= 27 will want to add:
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src
** enable native comp for packages
#+begin_src emacs-lisp
  (setq comp-deferred-compilation t)
#+end_src
** quelpa
https://github.com/quelpa/quelpa#installation
#+begin_src emacs-lisp
  (use-package quelpa :ensure t)
#+end_src
** Setting up paths
#+begin_src emacs-lisp
  (use-package exec-path-from-shell :ensure t)
  ;; (when (memq window-system '(mac ns x))
  ;;   (exec-path-from-shell-initialize))
  ;; (when (daemonp)
  ;;   (exec-path-from-shell-initialize))
  ;; (exec-path-from-shell-copy-env "export ORACLE_HOME=/opt/oracle/product/18c/dbhomeXE")

#+end_src
* Customizing the Editor and Appearence
** Dashboard
#+begin_src emacs-lisp
  (use-package dashboard :ensure t
    :init      ;; tweak dashboard config before loading it
    (setq dashboard-set-heading-icons t)
    ;; Content is not centered by default. To center, set
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
    (setq dashboard-startup-banner `logo) ;; use standard emacs logo as banner
    ;;(setq dashboard-startup-banner 'logo)
    ;;(setq dashboard-startup-banner "~/.emacs.d/emacs-dash3.png")  ;; use custom image as banner
    (setq dashboard-center-content t)
    (setq dashboard-set-navigator t)
    (setq dashboard-page-separator  "\n\f\n")
    (setq dashboard-items '((recents . 5)
                            (agenda . 5 )
                            (bookmarks . 5)
                            (projects . 3)
                            ))
    :config
    (dashboard-setup-startup-hook)
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book"))))

  ;;(add-hook 'after-init-hook (lambda () (switch-to-buffer "*dashboard*")))
                                          ; for emacsclient
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src
** Page break lines
#+begin_src emacs-lisp
  (use-package page-break-lines :ensure t)
#+end_src
** highlight current line
#+begin_src emacs-lisp
  (global-hl-line-mode +1)
#+end_src

** properly maximize windws emacs
#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t)
#+end_src
** theme
#+begin_src emacs-lisp
  ;; (use-package dracula- ensure t)
  (use-package doom-themes :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-dracula  t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

#+end_src
** Disable Menubar
#+begin_src emacs-lisp
  (menu-bar-mode -1)
#+end_src
** Disable Toolbar
#+begin_src emacs-lisp
  (tool-bar-mode -1)
#+end_src
** disable scrollbar
#+begin_src emacs-lisp
  (scroll-bar-mode -1)
#+end_src
** All the icon fonts
#+begin_src emacs-lisp
  (use-package all-the-icons :ensure t)
#+end_src
** Line Numbers
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+end_src
** Doom modeline
#+begin_src emacs-lisp
  (use-package doom-modeline :ensure t)
  (doom-modeline-mode 1)
#+end_src

** Loading the theme
#+begin_src emacs-lisp
  ;;(load-theme 'doom-dracula t)
#+end_src

** Fonts
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
                      :font "FiraCode Nerd Font 11"
                      :weight 'medium)
  (set-face-attribute 'variable-pitch nil
                      :font "FiraCode Nerd Font  11"
                      :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
                      :font "FiraCode Nerd Font 11"
                      :weight 'medium)
  ;; Makes commented text italics (working in emacsclient but not emacs)
  (set-face-attribute 'font-lock-comment-face nil
                      :slant 'italic)
  ;; Makes keywords italics (working in emacsclient but not emacs)
  (set-face-attribute 'font-lock-keyword-face nil
                      :slant 'italic)

  ;; Uncomment the following line if line spacing needs adjusting.
  (setq-default line-spacing 0.12)

  ;; Needed if using emacsclient. Otherwise, your fonts will be smaller than expected.
  (add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font 11"))
  ;; changes certain keywords to symbols, such as lamda!
  (setq global-prettify-symbols-mode t)

#+end_src
** Evil mode
https://github.com/emacs-evil/evil
Evil is an extensible vi layer for Emacs. It emulates the main features of Vim,
