emacs.d-gnu/config.html
<div id="outline-container-org9e53866" class="outline-3">
<h3 id="org9e53866"><span class="section-number-3">3.2.</span> straight.el: make sure to later remove package.el</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package) ; make sure use package is installed
(use-package el-patch
  :straight t)                   ;and now we will have use package here
</pre>
</div>
<p>
note: Users of Emacs versions &gt;= 27 will want to add:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq package-enable-at-startup nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9160c4e" class="outline-3">
<h3 id="org9160c4e"><span class="section-number-3">3.3.</span> quelpa</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<a href="https://github.com/quelpa/quelpa#installation">https://github.com/quelpa/quelpa#installation</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package quelpa :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1df2d35" class="outline-3">
<h3 id="org1df2d35"><span class="section-number-3">3.4.</span> Setting up paths</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package exec-path-from-shell :straight t)
;; (when (memq window-system '(mac ns x))
;;   (exec-path-from-shell-initialize))
;; (when (daemonp)
;;   (exec-path-from-shell-initialize))
;; (exec-path-from-shell-copy-env "export ORACLE_HOME=/opt/oracle/product/18c/dbhomeXE")

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3366ca9" class="outline-2">
<h2 id="org3366ca9"><span class="section-number-2">4.</span> Customizing the Editor and Appearence</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcaeb3bf" class="outline-3">
<h3 id="orgcaeb3bf"><span class="section-number-3">4.1.</span> Dashboard</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dashboard :straight t
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  ;; Content is not centered by default. To center, set
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
  (setq dashboard-startup-banner `logo) ;; use standard emacs logo as banner
  ;;(setq dashboard-startup-banner 'logo)
  ;;(setq dashboard-startup-banner "~/.emacs.d/emacs-dash3.png")  ;; use custom image as banner
  (setq dashboard-center-content t)
  (setq dashboard-set-navigator t)
  (setq dashboard-page-separator  "\n\f\n")
  (setq dashboard-items '((recents . 5)
			  (agenda . 5 )
			  (bookmarks . 5)
			  (projects . 3)
					;(registers . 3)
			  ))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
				    (bookmarks . "book"))))

;;(add-hook 'after-init-hook (lambda () (switch-to-buffer "*dashboard*")))
					; for emacsclient
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7d0978" class="outline-3">
<h3 id="orge7d0978"><span class="section-number-3">4.2.</span> Page break lines</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package page-break-lines :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org47ffae9" class="outline-3">
<h3 id="org47ffae9"><span class="section-number-3">4.3.</span> highlight current line</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-hl-line-mode +1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org806a2fa" class="outline-3">
<h3 id="org806a2fa"><span class="section-number-3">4.4.</span> properly maximize windws emacs</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq frame-resize-pixelwise t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9462a7b" class="outline-3">
<h3 id="org9462a7b"><span class="section-number-3">4.5.</span> theme</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (use-package dracula- straight t)
(use-package doom-themes :straight t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-dracula  t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

</pre>
</div>
</div>
</div>
<div id="outline-container-org6488bda" class="outline-3">
<h3 id="org6488bda"><span class="section-number-3">4.6.</span> Disable Menubar</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1) 
</pre>
</div>
</div>
</div>
<div id="outline-container-orge42157e" class="outline-3">
<h3 id="orge42157e"><span class="section-number-3">4.7.</span> Disable Toolbar</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode -1) 
</pre>
</div>
</div>
</div>
<div id="outline-container-org193d40b" class="outline-3">
<h3 id="org193d40b"><span class="section-number-3">4.8.</span> disable scrollbar</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(scroll-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org332a1b4" class="outline-3">
<h3 id="org332a1b4"><span class="section-number-3">4.9.</span> All the icon fonts</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb89c04c" class="outline-3">
<h3 id="orgb89c04c"><span class="section-number-3">4.10.</span> Line Numbers</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1324337" class="outline-3">
<h3 id="org1324337"><span class="section-number-3">4.11.</span> Doom modeline</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-modeline :straight t)
(doom-modeline-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc47c6ee" class="outline-3">
<h3 id="orgc47c6ee"><span class="section-number-3">4.12.</span> Loading the theme</h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;(load-theme 'doom-dracula t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a847b2" class="outline-3">
<h3 id="org0a847b2"><span class="section-number-3">4.13.</span> Fonts</h3>
<div class="outline-text-3" id="text-4-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute 'default nil
		    :font "FiraCode Nerd Font 11"
		    :weight 'medium)
(set-face-attribute 'variable-pitch nil
		    :font "FiraCode Nerd Font  11"
		    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
		    :font "FiraCode Nerd Font 11"
		    :weight 'medium)
;; Makes commented text italics (working in emacsclient but not emacs)
(set-face-attribute 'font-lock-comment-face nil
		    :slant 'italic)
;; Makes keywords italics (working in emacsclient but not emacs)
(set-face-attribute 'font-lock-keyword-face nil
		    :slant 'italic)

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0.12)

;; Needed if using emacsclient. Otherwise, your fonts will be smaller than expected.
(add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font 11"))
;; changes certain keywords to symbols, such as lamda!
(setq global-prettify-symbols-mode t)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf87a7b0" class="outline-3">
<h3 id="orgf87a7b0"><span class="section-number-3">4.14.</span> Evil mode</h3>
<div class="outline-text-3" id="text-4-14">
<p>
<a href="https://github.com/emacs-evil/evil">https://github.com/emacs-evil/evil</a>
Evil is an extensible vi layer for Emacs. It emulates the main features of Vim,
</p>
</div>
