emacs.d-gnu/config.org
*** Default
#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general :ensure t
    :after evil
    :config
    (general-create-definer efs/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (efs/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org")))))

  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (evil-collection-init))


#+end_src
*** Evil args
#+begin_src emacs-lisp
  (use-package evil-args :ensure t)

  ;; bind evil-args text objects
  (define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
  (define-key evil-outer-text-objects-map "a" 'evil-outer-arg)

  ;; bind evil-forward/backward-args
  (define-key evil-normal-state-map "L" 'evil-forward-arg)
  (define-key evil-normal-state-map "H" 'evil-backward-arg)
  (define-key evil-motion-state-map "L" 'evil-forward-arg)
  (define-key evil-motion-state-map "H" 'evil-backward-arg)

  ;; bind evil-jump-out-args
  (define-key evil-normal-state-map "K" 'evil-jump-out-args)
#+end_src
*** Evil intent plus
#+begin_src emacs-lisp
  (use-package evil-indent-plus :ensure t)
#+end_src
*** Evil Snipe
#+begin_src emacs-lisp
  (use-package evil-snipe :ensure t)
  (evil-snipe-mode +1)
  (evil-snipe-override-mode +1)
#+end_src
** Undo system
#+begin_src emacs-lisp
  (use-package undo-tree
    :ensure t
    :after evil
    :diminish
    :config
    (evil-set-undo-system 'undo-tree)
    (global-undo-tree-mode 1))
#+end_src

** Padding
#+begin_src emacs-lisp
  (push '(internal-border-width . 10) default-frame-alist)
#+end_src

** perspective
https://github.com/nex3/perspective-el
The Perspective package provides multiple named workspaces (or "perspectives") in Emacs, similar to multiple desktops in window managers like Awesome and XMonad, and Spaces on the Mac.
Each perspective has its own buffer list and its own window layout, along with some other isolated niceties, like the xref ring. This makes it easy to work on many separate projects without getting lost in all the buffers. Switching to a perspective activates its window configuration, and when in a perspective, only its buffers are available (by default).
Each Emacs frame has a distinct list of perspectives.
Perspective supports saving its state to a file, so long-lived work sessions may be saved and recovered as needed.

To activate perspective use (persp-mode). This creates a single default main perpsective.

Commands are all prefixed by C-x x by default. To change the prefix key, customize persp-mode-prefix-key. Additionally, creating a key binding for persp-mode-map will also activate the prefix.

Here are the main commands defined in persp-mode-map:

s — persp-switch: Query a perspective to switch to, or create
` — persp-switch-by-number: Switch to perspective by number, or switch quickly using numbers 1, 2, 3.. 0 as prefix args; note this will probably be most useful with persp-sort set to 'created
k — persp-remove-buffer: Query a buffer to remove from current perspective
c — persp-kill : Query a perspective to kill
r — persp-rename: Rename current perspective
a — persp-add-buffer: Query an open buffer to add to current perspective
A — persp-set-buffer: Add buffer to current perspective and remove it from all others
b - persp-switch-to-buffer: Like switch-to-buffer; includes all buffers from all perspectives; changes perspective if necessary
i — persp-import: Import a given perspective from another frame.
n, <right> — persp-next: Switch to next perspective
p, <left> — persp-prev: Switch to previous perspective
C-s — persp-state-save: Save all perspectives in all frames to a file
C-l — persp-state-load: Load all perspectives from a file

#+begin_src emacs-lisp
  ;; (use-package perspective :ensure t
  ;;   :bind
  ;;   ("C-x C-b" . persp-list-buffers)   ; or use a nicer switcher, see below
  ;;   :init
  ;;   (persp-mode))
#+end_src

** brackets
#+begin_src emacs-lisp
  (show-paren-mode 1)
  (setq show-paren-style 'parenthesis)
#+end_src

** tramp
#+begin_src emacs-lisp
                                          ; (use-package tramp :ensure t)
                                          ; (require 'tramp)
#+end_src
* Hook to tangle on save
#+begin_src emacs-lisp
  (defun f2k--tangle-all-org-on-save-h ()
    "Tangle org files on save."
    (if (string= (file-name-extension (buffer-file-name)) "org")
        (org-babel-tangle)))

  (add-hook 'after-save-hook #'f2k--tangle-all-org-on-save-h)

#+end_src
* Org mode:
#+begin_src emacs-lisp
  (use-package org :ensure t)
#+end_src
** org mode indent
#+begin_src emacs-lisp
  (setq org-startup-indented t)
#+end_src
** Org blocks insert mode
Switch to org edit mode when pressing `i` insert key
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
  (lambda ()
    (add-hook 'evil-insert-state-entry-hook
      (lambda ()
        (when (org-in-src-block-p)
          (org-edit-special)
          (evil-insert-state)))
      0 t)))
#+end_src
** snippets:
*** yas-snippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (setq yas-snippet-dirs '("~/dotfiles/emacs.d-gnu/snippets"))
    )
  (require 'yasnippet)
  (yas-global-mode 1)

#+end_src
*** doom snippets
see  https://github.com/hlissner/doom-snippets
#+begin_src emacs-lisp
  ;; (use-package doom-snippets
  ;;   :ensure t
  ;;   :load-path "/home/drishal/.emacs.d/custom-repos/doom-snippets"
  ;;   :after yasnippet)
#+end_src
** org tempo for all the beautiful snippets:

#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src
