emacs.d-gnu/config.html
<div id="outline-container-org5716250" class="outline-4">
<h4 id="org5716250"><span class="section-number-4">4.14.1.</span> Default</h4>
<div class="outline-text-4" id="text-4-14-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Make ESC quit prompts
(global-set-key (kbd "&lt;escape&gt;") 'keyboard-escape-quit)

(use-package general :straight t
  :after evil
  :config
  (general-create-definer efs/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (efs/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org")))))

(use-package evil
  :straight t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :straight t
  :after evil
  :config
  (evil-collection-init))


</pre>
</div>
</div>
</div>
<div id="outline-container-orga490346" class="outline-4">
<h4 id="orga490346"><span class="section-number-4">4.14.2.</span> Evil args</h4>
<div class="outline-text-4" id="text-4-14-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-args :straight t)

;; bind evil-args text objects
(define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
(define-key evil-outer-text-objects-map "a" 'evil-outer-arg)

;; bind evil-forward/backward-args
(define-key evil-normal-state-map "L" 'evil-forward-arg)
(define-key evil-normal-state-map "H" 'evil-backward-arg)
(define-key evil-motion-state-map "L" 'evil-forward-arg)
(define-key evil-motion-state-map "H" 'evil-backward-arg)

;; bind evil-jump-out-args
(define-key evil-normal-state-map "K" 'evil-jump-out-args)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaae4cca" class="outline-4">
<h4 id="orgaae4cca"><span class="section-number-4">4.14.3.</span> Evil intent plus</h4>
<div class="outline-text-4" id="text-4-14-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-indent-plus :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org677027b" class="outline-4">
<h4 id="org677027b"><span class="section-number-4">4.14.4.</span> Evil Snipe</h4>
<div class="outline-text-4" id="text-4-14-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-snipe :straight t)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org728b95a" class="outline-3">
<h3 id="org728b95a"><span class="section-number-3">4.15.</span> Undo system</h3>
<div class="outline-text-3" id="text-4-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package undo-tree
  :straight t
  :after evil
  :diminish
  :config
  (evil-set-undo-system 'undo-tree)
  (global-undo-tree-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8dafcec" class="outline-3">
<h3 id="org8dafcec"><span class="section-number-3">4.16.</span> Padding</h3>
<div class="outline-text-3" id="text-4-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(push '(internal-border-width . 10) default-frame-alist)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe2e429" class="outline-3">
<h3 id="orgfe2e429"><span class="section-number-3">4.17.</span> perspective</h3>
<div class="outline-text-3" id="text-4-17">
<p>
<a href="https://github.com/nex3/perspective-el">https://github.com/nex3/perspective-el</a>
The Perspective package provides multiple named workspaces (or "perspectives") in Emacs, similar to multiple desktops in window managers like Awesome and XMonad, and Spaces on the Mac.
Each perspective has its own buffer list and its own window layout, along with some other isolated niceties, like the xref ring. This makes it easy to work on many separate projects without getting lost in all the buffers. Switching to a perspective activates its window configuration, and when in a perspective, only its buffers are available (by default).
Each Emacs frame has a distinct list of perspectives.
Perspective supports saving its state to a file, so long-lived work sessions may be saved and recovered as needed.
</p>

<p>
To activate perspective use (persp-mode). This creates a single default main perpsective.
</p>

<p>
Commands are all prefixed by C-x x by default. To change the prefix key, customize persp-mode-prefix-key. Additionally, creating a key binding for persp-mode-map will also activate the prefix.
</p>

<p>
Here are the main commands defined in persp-mode-map:
</p>

<p>
s — persp-switch: Query a perspective to switch to, or create
` — persp-switch-by-number: Switch to perspective by number, or switch quickly using numbers 1, 2, 3.. 0 as prefix args; note this will probably be most useful with persp-sort set to 'created
k — persp-remove-buffer: Query a buffer to remove from current perspective
c — persp-kill : Query a perspective to kill
r — persp-rename: Rename current perspective
a — persp-add-buffer: Query an open buffer to add to current perspective
A — persp-set-buffer: Add buffer to current perspective and remove it from all others
b - persp-switch-to-buffer: Like switch-to-buffer; includes all buffers from all perspectives; changes perspective if necessary
i — persp-import: Import a given perspective from another frame.
n, &lt;right&gt; — persp-next: Switch to next perspective
p, &lt;left&gt; — persp-prev: Switch to previous perspective
C-s — persp-state-save: Save all perspectives in all frames to a file
C-l — persp-state-load: Load all perspectives from a file
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (use-package perspective :straight t
;;   :bind
;;   ("C-x C-b" . persp-list-buffers)   ; or use a nicer switcher, see below
;;   :init
;;   (persp-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeaf6345" class="outline-3">
<h3 id="orgeaf6345"><span class="section-number-3">4.18.</span> brackets</h3>
<div class="outline-text-3" id="text-4-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(show-paren-mode 1)
(setq show-paren-style 'parenthesis)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1e7622" class="outline-3">
<h3 id="orgc1e7622"><span class="section-number-3">4.19.</span> tramp</h3>
<div class="outline-text-3" id="text-4-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">; (use-package tramp :straight t)
; (require 'tramp)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf09b0f6" class="outline-2">
<h2 id="orgf09b0f6"><span class="section-number-2">5.</span> Hook to tangle on save</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun f2k--tangle-all-org-on-save-h ()
  "Tangle org files on save."
  (if (string= (file-name-extension (buffer-file-name)) "org")
      (org-babel-tangle)))

(add-hook 'after-save-hook #'f2k--tangle-all-org-on-save-h)

</pre>
</div>
</div>
</div>
<div id="outline-container-org21834cc" class="outline-2">
<h2 id="org21834cc"><span class="section-number-2">6.</span> Org mode:</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org069f479" class="outline-3">
<h3 id="org069f479"><span class="section-number-3">6.1.</span> org mode indent</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-startup-indented t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3acd352" class="outline-3">
<h3 id="org3acd352"><span class="section-number-3">6.2.</span> snippets:</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org92d9b99" class="outline-4">
<h4 id="org92d9b99"><span class="section-number-4">6.2.1.</span> ya-snippet</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yasnippet  :straight t) 
(require 'yasnippet)
(yas-global-mode 1)

</pre>
</div>
</div>
</div>
<div id="outline-container-org2dfe9ef" class="outline-4">
<h4 id="org2dfe9ef"><span class="section-number-4">6.2.2.</span> doom snippets</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
see  <a href="https://github.com/hlissner/doom-snippets">https://github.com/hlissner/doom-snippets</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (use-package doom-snippets
;;   :straight t
;;   :load-path "/home/drishal/.emacs.d/custom-repos/doom-snippets"
;;   :after yasnippet)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9f83aa8" class="outline-3">
<h3 id="org9f83aa8"><span class="section-number-3">6.3.</span> org tempo for all the beautiful snippets:</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'org-tempo)
</pre>
</div>
</div>
</div>
