emacs.d-gnu/config.html
<div id="outline-container-org68bc48d" class="outline-3">
<h3 id="org68bc48d"><span class="section-number-3">7.5.</span> treemacs</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package treemacs
  :straight t
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
	  treemacs-deferred-git-apply-delay      0.5
	  treemacs-directory-name-transformer    #'identity
	  treemacs-display-in-side-window        t
	  treemacs-eldoc-display                 t
	  treemacs-file-event-delay              5000
	  treemacs-file-extension-regex          treemacs-last-period-regex-value
	  treemacs-file-follow-delay             0.2
	  treemacs-file-name-transformer         #'identity
	  treemacs-follow-after-init             t
	  treemacs-expand-after-init             t
	  treemacs-git-command-pipe              ""
	  treemacs-goto-tag-strategy             'refetch-index
	  treemacs-indentation                   2
	  treemacs-indentation-string            " "
	  treemacs-is-never-other-window         nil
	  treemacs-max-git-entries               5000
	  treemacs-missing-project-action        'ask
	  treemacs-move-forward-on-expand        nil
	  treemacs-no-png-images                 nil
	  treemacs-no-delete-other-windows       t
	  treemacs-project-follow-cleanup        nil
	  treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
	  treemacs-position                      'left
	  treemacs-read-string-input             'from-child-frame
	  treemacs-recenter-distance             0.1
	  treemacs-recenter-after-file-follow    nil
	  treemacs-recenter-after-tag-follow     nil
	  treemacs-recenter-after-project-jump   'always
	  treemacs-recenter-after-project-expand 'on-distance
	  treemacs-litter-directories            '("/node_modules" "/.venv" "/.cask")
	  treemacs-show-cursor                   nil
	  treemacs-show-hidden-files             t
	  treemacs-silent-filewatch              nil
	  treemacs-silent-refresh                nil
	  treemacs-sorting                       'alphabetic-asc
	  treemacs-space-between-root-nodes      t
	  treemacs-tag-follow-cleanup            t
	  treemacs-tag-follow-delay              1.5
	  treemacs-user-mode-line-format         nil
	  treemacs-user-header-line-format       nil
	  treemacs-width                         35
	  treemacs-workspace-switch-cleanup      nil)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (pcase (cons (not (null (executable-find "git")))
		 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple))))
  :bind
  (:map global-map
	("M-0"       . treemacs-select-window)
	("C-x t 1"   . treemacs-delete-other-windows)
	("C-x t t"   . treemacs)
	("C-x t B"   . treemacs-bookmark)
	("C-x t C-t" . treemacs-find-file)
	("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-evil
  :after (treemacs evil)
  :straight t)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :straight t)

(use-package treemacs-icons-dired
  :after (treemacs dired)
  :straight t
  :config (treemacs-icons-dired-mode))

(use-package treemacs-magit
  :after (treemacs magit)
  :straight t)

(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  :straight t
  :config (treemacs-set-scope-type 'Perspectives))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc969e94" class="outline-3">
<h3 id="orgc969e94"><span class="section-number-3">7.6.</span> elcord</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package elcord :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgccd51a1" class="outline-3">
<h3 id="orgccd51a1"><span class="section-number-3">7.7.</span> Shackle</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package shackle
  :straight t
  ;; :if (not (bound-and-true-p disable-pkg-shackle))
  :config
  (progn
    (setq shackle-lighter "")
    (setq shackle-select-reused-windows nil) ; default nil
    (setq shackle-default-alignment 'below) ; default below
    (setq shackle-default-size 0.4) ; default 0.5

    (setq shackle-rules
	  ;; CONDITION(:regexp)            :select     :inhibit-window-quit   :size+:align|:other     :same|:popup
	  '((compilation-mode              :select nil                                               )
	    ("*undo-tree*"                 :select t                          :size 0.25 :align right)
	    ("\\*vterm.*\\*"  :regexp t    :select t                          :size 0.4  :align below)
	    ;; ("*eshell*"                    :select t                          :other t               )
	    ;;         ("*Shell Command Output*"      :select nil                                               )
	    ;;         ("\\*Async Shell.*\\*" :regexp t :ignore t                                                 )
	    ;;         (occur-mode                    :select nil                                   :align t    )
	    ;;         ("*Help*"                      :select t   :inhibit-window-quit t :other t               )
	    ;;         ("*Completions*"                                                  :size 0.3  :align t    )
	    ;;         ("*Messages*"                  :select nil :inhibit-window-quit t :other t               )
	    ;;         ("\\*[Wo]*Man.*\\*"    :regexp t :select t   :inhibit-window-quit t :other t               )
	    ;;         ("\\*poporg.*\\*"      :regexp t :select t                          :other t               )
	    ;;         ("\\`\\*helm.*?\\*\\'"   :regexp t                                    :size 0.3  :align t    )
	    ;;         ("*calendar*"                  :select t                          :size 0.5  :align below)
	    ;;         ("*info*"                      :select t   :inhibit-window-quit t                         :same t)
	    ;;         (magit-status-mode             :select t   :inhibit-window-quit t                         :same t)
	    ;;         (magit-log-mode                :select t   :inhibit-window-quit t                         :same t)
	    ))

    (shackle-mode 1)))


(provide 'setup-shackle)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7f1977" class="outline-3">
<h3 id="orgb7f1977"><span class="section-number-3">7.8.</span> pacman</h3>
<div class="outline-text-3" id="text-7-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package pacmacs :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7351716" class="outline-3">
<h3 id="org7351716"><span class="section-number-3">7.9.</span> popper.el TODO</h3>
<div class="outline-text-3" id="text-7-9">
<p>
<a href="https://github.com/karthink/popper">https://github.com/karthink/popper</a>
</p>
</div>
</div>

<div id="outline-container-org03cb49f" class="outline-3">
<h3 id="org03cb49f"><span class="section-number-3">7.10.</span> Using EXWM</h3>
<div class="outline-text-3" id="text-7-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package exwm :straight t)
					;(require 'exwm)
					;(require 'exwm-config)
					;(exwm-config-default)

</pre>
</div>
</div>
</div>
