emacs.d-gnu/config.org
** ERC server settings
#+begin_src emacs-lisp
  (require 'erc)
  (setq erc-default-server "irc.libera.chat")
  (add-hook 'window-configuration-change-hook
            '(lambda ()
               (setq erc-fill-column (- (window-width) 2))))
#+end_src

** elfeed RSS reader
#+begin_src emacs-lisp
  (use-package elfeed :ensure t)
  (setq elfeed-feeds
        '(
          ("https://archlinux.org/feeds/news/" Arch Linux)
          ("https://weekly.nixos.org/feeds/all.rss.xml" NixOS)
          ("https://www.phoronix.com/rss.php" Phoronix)
          ("https://suckless.org/atom.xml" suckless)
          ("https://micronews.debian.org/feeds/feed.rss" Debian)
          )
        )
#+end_src

* Language and completion support
** completion engines:
*** company mode
#+begin_src emacs-lisp
  (use-package company :ensure t)

  ;; (use-package company-lsp
  ;;     :ensure t
  ;;     :config
  ;;     (push 'company-lsp company-backends))

  (add-hook 'after-init-hook 'global-company-mode)
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.0) ;; default is 0.2

#+end_src
** using tabnine for completion
#+begin_src emacs-lisp
  ;;    (use-package company-tabnine :ensure t)
  ;;  (require 'company-tabnine)
  ;; (add-to-list 'company-backends #'company-tabnine)
#+end_src

** emoji mode
#+begin_src emacs-lisp
  (use-package emojify
    :ensure t
    :hook (after-init . global-emojify-mode))
#+end_src
** Parentheses Completion
#+begin_src emacs-lisp
  (use-package smartparens :ensure t)
  (require 'smartparens)
  ;; (add-hook 'smartparens-mode)
  (smartparens-global-mode t)
#+end_src
** Projectile
#+begin_src emacs-lisp
  (use-package projectile :ensure t)
  (require 'smartparens-config)
#+end_src

*** vertico and orderless
#+begin_src emacs-lisp
  ;; Enable vertico
  (use-package vertico :ensure t
    :init
    (vertico-mode)

    ;; Grow and shrink the Vertico minibuffer
    ;; (setq vertico-resize t)

    ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
    ;; (setq vertico-cycle t)
    )

  ;; Use the `orderless' completion style. Additionally enable
  ;; `partial-completion' for file path expansion. `partial-completion' is
  ;; important for wildcard support. Multiple files can be opened at once
  ;; with `find-file' if you enter a wildcard. You may also give the
  ;; `initials' completion style a try.
  (use-package orderless :ensure t
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist :ensure t
    :init
    (savehist-mode))

  ;; A few more useful configurations...
  (use-package emacs :ensure t
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; Alternatively try `consult-completing-read-multiple'.
    (defun crm-indicator (args)
      (cons (concat "[CRM] " (car args)) (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers.
    ;; (setq read-extended-command-predicate
    ;;       #'command-completion-default-include-p)

    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t))

#+end_src

