emacs.d-gnu/config.html
<div id="outline-container-org22159a1" class="outline-3">
<h3 id="org22159a1"><span class="section-number-3">7.11.</span> ERC server settings</h3>
<div class="outline-text-3" id="text-7-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'erc)
(setq erc-default-server "irc.libera.chat")
(add-hook 'window-configuration-change-hook 
	  '(lambda ()
	     (setq erc-fill-column (- (window-width) 2))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org01862a2" class="outline-3">
<h3 id="org01862a2"><span class="section-number-3">7.12.</span> elfeed RSS reader</h3>
<div class="outline-text-3" id="text-7-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package elfeed :straight t)
(setq elfeed-feeds
      '(
	("https://archlinux.org/feeds/news/" Arch Linux)
	("https://weekly.nixos.org/feeds/all.rss.xml" NixOS)
	("https://www.phoronix.com/rss.php" Phoronix)
	("https://suckless.org/atom.xml" suckless)
	("https://micronews.debian.org/feeds/feed.rss" Debian)
	)
      )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4dd6be" class="outline-2">
<h2 id="orgb4dd6be"><span class="section-number-2">8.</span> Language and completion support</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgd64d0a7" class="outline-3">
<h3 id="orgd64d0a7"><span class="section-number-3">8.1.</span> completion engines:</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgc2ea672" class="outline-4">
<h4 id="orgc2ea672"><span class="section-number-4">8.1.1.</span> company mode</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company :straight t)

;; (use-package company-lsp
;;     :straight t
;;     :config
;;     (push 'company-lsp company-backends))

(add-hook 'after-init-hook 'global-company-mode)
(setq company-minimum-prefix-length 1
      company-idle-delay 0.0) ;; default is 0.2

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb174f94" class="outline-3">
<h3 id="orgb174f94"><span class="section-number-3">8.2.</span> using tabnine for completion</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;    (use-package company-tabnine :straight t)
;;  (require 'company-tabnine)
;; (add-to-list 'company-backends #'company-tabnine)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb1b9ef" class="outline-3">
<h3 id="orgdb1b9ef"><span class="section-number-3">8.3.</span> emoji mode</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emojify
  :straight t
  :hook (after-init . global-emojify-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org85d0fb8" class="outline-3">
<h3 id="org85d0fb8"><span class="section-number-3">8.4.</span> Parentheses Completion</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package smartparens :straight t)
(require 'smartparens)
;; (add-hook 'smartparens-mode)
(smartparens-global-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d4f15c" class="outline-3">
<h3 id="org4d4f15c"><span class="section-number-3">8.5.</span> Projectile</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package projectile :straight t)
(require 'smartparens-config)
</pre>
</div>
</div>

<div id="outline-container-orge94d1dc" class="outline-4">
<h4 id="orge94d1dc"><span class="section-number-4">8.5.1.</span> vertico and orderless</h4>
<div class="outline-text-4" id="text-8-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Enable vertico
(use-package vertico :straight t
  :init
  (vertico-mode)

  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  ;; (setq vertico-cycle t)
  )

;; Use the `orderless' completion style. Additionally enable
;; `partial-completion' for file path expansion. `partial-completion' is
;; important for wildcard support. Multiple files can be opened at once
;; with `find-file' if you enter a wildcard. You may also give the
;; `initials' completion style a try.
(use-package orderless :straight t
  :init
  (setq completion-styles '(orderless)
	completion-category-defaults nil
	completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist :straight t
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs :straight t
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; Alternatively try `consult-completing-read-multiple'.
  (defun crm-indicator (args)
    (cons (concat "[CRM] " (car args)) (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
	'(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t))

</pre>
</div>
</div>
</div>
