emacs.d-gnu/config.org
*** General Setup
#+begin_src emacs-lisp
  (use-package flycheck :ensure t)
  (use-package lsp-mode :ensure t
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
           (rust-mode  . lsp)
           (html-mode  . lsp)
           (c-mode  . lsp)
           (c++-mode  . lsp)
           (css-mode . lsp)
           (zig-mode . lsp)
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
           (sh-mode . lsp)
           (lua-mode . lsp)
    :commands lsp)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode :ensure t)

  (setq lsp-ui-doc-enable nil)
  ;;(use-package lsp-treemacs :ensure t)
                                          ; (add-hook 'prog-mode-hook 'lsp)

  ;; (setq lsp-use-plists t)
  ;;(setq lsp-idle-delay 0.500)
#+end_src
*** Sqlplus
#+begin_src emacs-lisp
                                          ; (use-package sqlplus-mode :ensure t)

                                          ;   (let ((oracle-home (shell-command-to-string ". ~/.profile; echo -n $ORACLE_HOME"))) (if oracle-home (setenv "ORACLE_HOME" oracle-home)) (setenv "PATH" (concat (getenv "PATH") (format "%s/%s" oracle-home "bin"))) (add-to-list 'exec-path (format "%s/%s" oracle-home "bin")) ) This assumes that you’re using ZSH. Obviously, you should change the .zshrc reference to the
#+end_src
*** sql
#+begin_src emacs-lisp
  (require 'sql)
  (defalias 'sql-get-login 'ignore)
#+end_src
*** yaml-mode
#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t)
#+end_src
*** python
#+begin_src emacs-lisp
  (use-package lsp-pyright
    :ensure t
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            (lsp))))  ; or lsp-deferred

#+end_src
*** Haskell
**** haskell mode
#+begin_src emacs-lisp
  (use-package haskell-mode :ensure t)
#+end_src
*** Fish
#+begin_src emacs-lisp
  (use-package fish-mode :ensure t)
#+end_src
*** nix
#+begin_src emacs-lisp
  (use-package nix-mode :ensure t
    :mode "\\.nix\\'")
#+end_src
*** java
#+begin_src emacs-lisp
  ;(use-package lsp-java :ensure t)
  ;(add-hook 'java-mode-hook #'lsp)
#+end_src
*** lua
#+begin_src emacs-lisp
   (use-package lua-mode
    :ensure t
    :mode "\\.lua$"
    :interpreter "lua"
    :hook (lua-mode . set-company-backends-for-lua)
    :config
    (setq lua-indent-level 4)
    (setq lua-indent-string-contents t)
    (setq lua-prefix-key nil)
    )
#+end_src
*** web stuff
***** web mode
#+begin_src emacs-lisp
  (use-package web-mode :ensure t)
  (require 'web-mode)
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
#+end_src
*** lsp
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook
            (lambda ()
              ;; Use spaces, not tabs.
              (setq indent-tabs-mode nil)
              ;; Keep M-TAB for `completion-at-point'
              (define-key flyspell-mode-map "\M-\t" nil)
              ;; Pretty-print eval'd expressions.
              (define-key emacs-lisp-mode-map
                          "\C-x\C-e" 'pp-eval-last-sexp)
              ;; Recompile if .elc exists.
              (add-hook (make-local-variable 'after-save-hook)
                        (lambda ()
                          (byte-force-recompile default-directory)))
              (define-key emacs-lisp-mode-map
                          "\r" 'reindent-then-newline-and-indent)))
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
  (add-hook 'emacs-lisp-mode-hook 'flyspell-prog-mode) ;; Requires Ispell
#+end_src

*** C/C++ mode
#+begin_src emacs-lisp
                                          ;(add-hook 'c-mode-hook #'lsp)
                                          ;(add-hook 'c++-mode-hook #'lsp)
#+end_src
*** rust mode
#+begin_src emacs-lisp
  (use-package rust-mode :ensure t)
#+end_src
*** zig
#+begin_src emacs-lisp
  (use-package zig-mode :ensure t)
  (setq lsp-zig-zls-executable "~/zls/zls")
#+end_src
** which key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-sort-uppercase-first nil
          which-key-add-column-padding 1
          which-key-max-display-columns nil
          which-key-min-display-lines 6
          which-key-side-window-slot -10
          which-key-side-window-max-height 0.25
          which-key-idle-delay 0.8
          which-key-max-description-length 25
          which-key-allow-imprecise-window-fit t
          which-key-separator " → " ))
  (which-key-mode)
#+end_src

* prevent "saving to x clipboard manager
#+begin_src emacs-lisp
  (setq x-select-enable-clipboard-manager nil)
#+end_src

* prevent *warnings* buffer
#+begin_src emacs-lisp
  (setq-default warning-minimum-level :error)
#+end_src

* emacs typing latency
#+begin_src emacs-lisp
  ;;(setq redisplay-dont-pause t)
#+end_src
* Disable backups
#+begin_src emacs-lisp
  (setq make-backup-files nil)
#+end_src

* emacs fixing some window stuff
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  ;; (add-to-list 'default-frame-alist '(fullscreen . fullheight))
#+end_src

* restart emacs package
#+begin_src emacs-lisp
  (use-package restart-emacs :ensure t)
#+end_src
