emacs.d-gnu/config.html
<div id="outline-container-org4d78d50" class="outline-4">
<h4 id="org4d78d50"><span class="section-number-4">8.6.1.</span> General Setup</h4>
<div class="outline-text-4" id="text-8-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package flycheck :straight t)
(use-package lsp-mode :straight t
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
	 (rust-mode  . lsp)
	 (html-mode  . lsp)
	 (c-mode  . lsp)
	 (c++-mode  . lsp)
	 (css-mode . lsp)
	 (zig-mode . lsp)
	 ;; if you want which-key integration
	 (lsp-mode . lsp-enable-which-key-integration))
	 (sh-mode . lsp)
	 (lua-mode . lsp)
  :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode :straight t)

(setq lsp-ui-doc-enable nil)
(use-package lsp-treemacs :straight t)
					; (add-hook 'prog-mode-hook 'lsp)

;; (setq lsp-use-plists t)
;;(setq lsp-idle-delay 0.500)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7fbff4a" class="outline-4">
<h4 id="org7fbff4a"><span class="section-number-4">8.6.2.</span> Sqlplus</h4>
<div class="outline-text-4" id="text-8-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">; (use-package sqlplus-mode :straight t)

;   (let ((oracle-home (shell-command-to-string ". ~/.profile; echo -n $ORACLE_HOME"))) (if oracle-home (setenv "ORACLE_HOME" oracle-home)) (setenv "PATH" (concat (getenv "PATH") (format "%s/%s" oracle-home "bin"))) (add-to-list 'exec-path (format "%s/%s" oracle-home "bin")) ) This assumes that you’re using ZSH. Obviously, you should change the .zshrc reference to the 
</pre>
</div>
</div>
</div>
<div id="outline-container-orgccecc16" class="outline-4">
<h4 id="orgccecc16"><span class="section-number-4">8.6.3.</span> python</h4>
<div class="outline-text-4" id="text-8-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-pyright
  :straight t
  :hook (python-mode . (lambda ()
			 (require 'lsp-pyright)
			 (lsp))))  ; or lsp-deferred

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf72b3b" class="outline-4">
<h4 id="orgdf72b3b"><span class="section-number-4">8.6.4.</span> Haskell</h4>
<div class="outline-text-4" id="text-8-6-4">
</div>
<ol class="org-ol">
<li><a id="org08a7f55"></a>haskell mode<br />
<div class="outline-text-5" id="text-8-6-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package haskell-mode :straight t)
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org66b9b6d" class="outline-4">
<h4 id="org66b9b6d"><span class="section-number-4">8.6.5.</span> Fish</h4>
<div class="outline-text-4" id="text-8-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package fish-mode :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac5577d" class="outline-4">
<h4 id="orgac5577d"><span class="section-number-4">8.6.6.</span> nix</h4>
<div class="outline-text-4" id="text-8-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package nix-mode :straight t
  :mode "\\.nix\\'")
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb4d168" class="outline-4">
<h4 id="orgcb4d168"><span class="section-number-4">8.6.7.</span> java</h4>
<div class="outline-text-4" id="text-8-6-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-java :straight t)
(add-hook 'java-mode-hook #'lsp)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeaf6b55" class="outline-4">
<h4 id="orgeaf6b55"><span class="section-number-4">8.6.8.</span> lua</h4>
<div class="outline-text-4" id="text-8-6-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lua-mode
 :straight t
 :mode "\\.lua$"
 :interpreter "lua"
 :hook (lua-mode . set-company-backends-for-lua)
 :config
 (setq lua-indent-level 4)
 (setq lua-indent-string-contents t)
 (setq lua-prefix-key nil)
 )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc40d1b" class="outline-4">
<h4 id="orgfc40d1b"><span class="section-number-4">8.6.9.</span> web stuff</h4>
<div class="outline-text-4" id="text-8-6-9">
</div>
<ol class="org-ol">
<li><a id="org0bc3d24"></a>web mode<br />
<div class="outline-text-6" id="text-8-6-9-0-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package web-mode :straight t)
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8544720" class="outline-4">
<h4 id="org8544720"><span class="section-number-4">8.6.10.</span> C/C++ mode</h4>
<div class="outline-text-4" id="text-8-6-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;(add-hook 'c-mode-hook #'lsp) 
;(add-hook 'c++-mode-hook #'lsp) 
</pre>
</div>
</div>
</div>
<div id="outline-container-org94d98f6" class="outline-4">
<h4 id="org94d98f6"><span class="section-number-4">8.6.11.</span> rust mode</h4>
<div class="outline-text-4" id="text-8-6-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rust-mode :straight t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4066c5b" class="outline-4">
<h4 id="org4066c5b"><span class="section-number-4">8.6.12.</span> zig</h4>
<div class="outline-text-4" id="text-8-6-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package zig-mode :straight t) 
(setq lsp-zig-zls-executable "~/zls/zls")
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org70fd8e3" class="outline-3">
<h3 id="org70fd8e3"><span class="section-number-3">8.7.</span> which key</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
  :straight t
  :init
  (setq which-key-side-window-location 'bottom
	which-key-sort-order #'which-key-key-order-alpha
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10
	which-key-side-window-max-height 0.25
	which-key-idle-delay 0.8
	which-key-max-description-length 25
	which-key-allow-imprecise-window-fit t
	which-key-separator " → " ))
(which-key-mode)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc9bdd13" class="outline-2">
<h2 id="orgc9bdd13"><span class="section-number-2">9.</span> prevent "saving to x clipboard manager</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq x-select-enable-clipboard-manager nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org76f3f10" class="outline-2">
<h2 id="org76f3f10"><span class="section-number-2">10.</span> prevent <b>warnings</b> buffer</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-default warning-minimum-level :error)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f12cb6" class="outline-2">
<h2 id="org1f12cb6"><span class="section-number-2">11.</span> emacs typing latency</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq redisplay-dont-pause t) 
</pre>
</div>
</div>
</div>
<div id="outline-container-org1a1d3ab" class="outline-2">
<h2 id="org1a1d3ab"><span class="section-number-2">12.</span> Disable backups</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq make-backup-files nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b8c7a0" class="outline-2">
<h2 id="org6b8c7a0"><span class="section-number-2">13.</span> emacs fixing some window stuff</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'default-frame-alist '(fullscreen . maximized))
;; (add-to-list 'default-frame-alist '(fullscreen . fullheight))
</pre>
</div>
</div>
</div>

<div id="outline-container-org036d680" class="outline-2">
<h2 id="org036d680"><span class="section-number-2">14.</span> restart emacs package</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package restart-emacs :straight t)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-11-22 Mon 11:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
